
    // Do not modify this file by hand!
    // Re-generate this file by running lit-localize

    import {html} from 'lit';
    

    /* eslint-disable no-irregular-whitespace */
    /* eslint-disable @typescript-eslint/no-explicit-any */

    export const templates = {
      'hc60fe849d5871ed0': html`Ключ + 
          <b> Сол
          </b>
        `,
's082194e632f41463': `Хеш функция`,
's340c5424c1068661': `Сол`,
's3e99b3826b00964c': `Изтриване на възли`,
's506b6a19d12f414c': `Ключ`,
's5f343a43e7ea9f91': `Грешка`,
's658e6a008311409f': `Плъзнете и пуснете възлите в редактора`,
's6bc7b85be71db921': `Превключване на тези настройки за изгледа на автора и на студента.`,
's7c0462add8379ba2': `Резултат от хеширането`,
's80a693fdbbc735b3': `Задължителен възел за хеширане`,
's8617fc8fa9c02980': `Хеш стойност`,
's87730e5071589cc6': `Редактор на хеш`,
's8a0ee3d87938f19a': `Възли`,
'sa61cbfcfe4598f64': `Незадължителен възел за солта`,
'sc26501e3ade7da3c': `Инструменти`,
'sc582b5508c2961d1': `Въведете ключ...`,
'scc2f08380b867322': `Превключване на менюто на възела`,
'sd5fc23432952db23': `Въвеждане на ключ + Salt`,
'sd9bdfc0f95188eea': `Изтриване на възел`,
'sdccd8f78d52d3a87': `Копиране в клипборда`,
'sdf86efcdc302af52': `Изберете хеш функция`,
'se34da59fd0f2a3e1': `Добавяне на възли`,
'seded5609c55e7071': `Фокус върху възлите`,
'sfe7895d83752c894': `Текст със сол`,
    };
  