
    // Do not modify this file by hand!
    // Re-generate this file by running lit-localize

    import {html} from 'lit';
    

    /* eslint-disable no-irregular-whitespace */
    /* eslint-disable @typescript-eslint/no-explicit-any */

    export const templates = {
      'hc60fe849d5871ed0': html`Κλειδί + 
          <b> Salt
          </b>
        `,
's082194e632f41463': `Συνάρτηση κατακερματισμού`,
's340c5424c1068661': `Salt`,
's3e99b3826b00964c': `Διαγραφή κόμβων`,
's506b6a19d12f414c': `Κλειδί`,
's5f343a43e7ea9f91': `Σφάλμα`,
's658e6a008311409f': `Σύρετε και αποθέστε τους κόμβους στον επεξεργαστή`,
's6bc7b85be71db921': `Εναλλαγή αυτών των ρυθμίσεων για την προβολή του δημιουργού και του μαθητή.`,
's7c0462add8379ba2': `Αποτέλεσμα της τιμής κατακερματισμού`,
's80a693fdbbc735b3': `Απαιτούμενος κόμβος για την κρυπτογράφηση`,
's8617fc8fa9c02980': `Τιμή κατακερματισμού`,
's87730e5071589cc6': `Επεξεργαστής κατακερματισμού`,
's8a0ee3d87938f19a': `Κόμβοι`,
'sa61cbfcfe4598f64': `Προαιρετικός κόμβος για το Salting`,
'sc26501e3ade7da3c': `Εργαλεία`,
'sc582b5508c2961d1': `Εισαγάγετε ένα κλειδί...`,
'scc2f08380b867322': `Εναλλαγή μενού κόμβου`,
'sd5fc23432952db23': `Εισαγωγή κλειδιού + Salt`,
'sd9bdfc0f95188eea': `Διαγραφή κόμβου`,
'sdccd8f78d52d3a87': `Αντιγραφή στο πρόχειρο`,
'sdf86efcdc302af52': `Επιλέξτε μια συνάρτηση κατακερματισμού`,
'se34da59fd0f2a3e1': `Προσθήκη κόμβων`,
'seded5609c55e7071': `Εστίαση στους κόμβους`,
'sfe7895d83752c894': `Κείμενο Salt`,
    };
  