
    // Do not modify this file by hand!
    // Re-generate this file by running lit-localize

    import {html} from 'lit';
    

    /* eslint-disable no-irregular-whitespace */
    /* eslint-disable @typescript-eslint/no-explicit-any */

    export const templates = {
      'hc60fe849d5871ed0': html`Ключ + 
          <b> Соль
          </b>
        `,
's082194e632f41463': `Функция хеширования`,
's340c5424c1068661': `Соль`,
's3e99b3826b00964c': `Удаление узлов`,
's506b6a19d12f414c': `Ключ`,
's5f343a43e7ea9f91': `Ошибка`,
's658e6a008311409f': `Перетащите узлы в редактор`,
's6bc7b85be71db921': `Переключить эти настройки для режимов просмотра «Автор» и «Студент».`,
's7c0462add8379ba2': `Результат хеширования`,
's80a693fdbbc735b3': `Узел, необходимый для хеширования`,
's8617fc8fa9c02980': `Хеш-значение`,
's87730e5071589cc6': `Редактор хешей`,
's8a0ee3d87938f19a': `Узлы`,
'sa61cbfcfe4598f64': `Необязательный узел для соления`,
'sc26501e3ade7da3c': `Инструменты`,
'sc582b5508c2961d1': `Введите ключ...`,
'scc2f08380b867322': `Переключить меню узла`,
'sd5fc23432952db23': `Ввод ключа + соль`,
'sd9bdfc0f95188eea': `Удалите узел`,
'sdccd8f78d52d3a87': `Копировать в буфер обмена`,
'sdf86efcdc302af52': `Выберите хеш-функцию`,
'se34da59fd0f2a3e1': `Добавление узлов`,
'seded5609c55e7071': `Фокус на узлах`,
'sfe7895d83752c894': `Текст соли`,
    };
  