
    // Do not modify this file by hand!
    // Re-generate this file by running lit-localize

    import {html} from 'lit';
    

    /* eslint-disable no-irregular-whitespace */
    /* eslint-disable @typescript-eslint/no-explicit-any */

    export const templates = {
      'hc60fe849d5871ed0': html`Ключ + 
          <b> Соль
          </b>
        `,
's082194e632f41463': `Хеш-функція`,
's340c5424c1068661': `Солт`,
's3e99b3826b00964c': `Видалення вузлів`,
's506b6a19d12f414c': `Ключ`,
's5f343a43e7ea9f91': `Помилка`,
's658e6a008311409f': `Перетягніть вузли в редактор`,
's6bc7b85be71db921': `Увімкнути/вимкнути ці налаштування для режиму автора та студента.`,
's7c0462add8379ba2': `Результат хешування`,
's80a693fdbbc735b3': `Необхідний вузол для хешування`,
's8617fc8fa9c02980': `Хеш-значення`,
's87730e5071589cc6': `Редактор хеш-функцій`,
's8a0ee3d87938f19a': `Вузли`,
'sa61cbfcfe4598f64': `Необов'язковий вузол для соління`,
'sc26501e3ade7da3c': `Інструменти`,
'sc582b5508c2961d1': `Введіть ключ...`,
'scc2f08380b867322': `Перемикання меню вузла`,
'sd5fc23432952db23': `Введення ключа + соль`,
'sd9bdfc0f95188eea': `Видалити вузол`,
'sdccd8f78d52d3a87': `Скопіювати в буфер обміну`,
'sdf86efcdc302af52': `Виберіть хеш-функцію`,
'se34da59fd0f2a3e1': `Додавання вузлів`,
'seded5609c55e7071': `Фокус на вузлах`,
'sfe7895d83752c894': `Текст солі`,
    };
  